[{"model": "exercises.exercise", "pk": 1, "fields": {"name": "Barbell Bench Press", "description": "The bench press and all its variations (incline, decline, close-grip, with dumbbells, and the floor press) target the chest, triceps, and shoulders. Like most barbell exercises, it allows you to use a greater load (because of the relatively straight bar path and the stability of the bench) than you could muster with kettlebells or dumbbells. For powerlifters, this move is a must-do as it’s one of the three main competition lifts (the other two being the back squat and deadlift).", "how_to_do": "The bench press and all its variations (incline, decline, close-grip, with dumbbells, and the floor press) target the chest, triceps, and shoulders. Like most barbell exercises, it allows you to use a greater load (because of the relatively straight bar path and the stability of the bench) than you could muster with kettlebells or dumbbells. For powerlifters, this move is a must-do as it’s one of the three main competition lifts (the other two being the back squat and deadlift).", "sets": 5, "image": "https://cdn.shopify.com/s/files/1/0269/5551/3900/files/Barbell-Bench-Press_0316b783-43b2-44f8-8a2b-b177a2cfcbfc_600x600.png?v=1612137800", "video": "Zw6qCAFsV0w", "expert_opinions": "The bench press is good enough for your chest if you’re an advanced lifter, a lifter with time restrictions, or someone who struggles with recovery. But, lifters who are weak at the bottom of the bench press, have physique goals, or are just starting out, should include additional chest training.", "groups": [2, 11, 4]}}, {"model": "exercises.exercise", "pk": 2, "fields": {"name": "Bent Over Barbell Row", "description": "The bent over row is a fantastic exercise to strengthen and increase mass in the upper back and lats and reinforce good hip hinge mechanics. Because you’re in a hip hinge position, this trains the lower back isometrically, making it a great accessory exercise to improve your deadlift. The bent-over row (and the Pendley row) is a horizontal row variation that allows you to use the most weight. In most cases, more weight equals more muscle and strength.", "how_to_do": "Put a loaded barbell on the floor stand with your feet slightly more than hip-width apart. Hinge down to the barbell and grab the barbell with a shoulder-width grip. Then bring the barbell up to knee level with back straight and torso bent at 45 degrees. Pull the barbell to between your navel and sternum. Pause, then slowly lower the barbell back down and repeat.", "sets": 5, "image": "https://cdn.shopify.com/s/files/1/0269/5551/3900/files/Barbell-Bent-Over-Rows-Supinated-Grip_600x600.png?v=1619977891", "video": "ML1L5ytxLMY", "expert_opinions": "Bent over rows are a great movement to increase back strength and muscle growth. Movements like the deadlift, squat, bench press, loaded carries, and overhead lifts all require a strong back, making the bent-over barbell row an excellent accessory exercise for all strength athletes.", "groups": [1, 3, 7]}}, {"model": "exercises.exercise", "pk": 3, "fields": {"name": "Overhead Press", "description": "The overhead press is a fantastic shoulder exercise, no doubt. But how often do you find yourself not moving your lower body to get something overhead? The push press uses the triple extension of the ankles, knees, and hips, which closely mimics what most overhead athletes do on the field and you do at home or the gym. Plus, the lower body dip allows you to lift more weight overhead than the barbell overhead press. Lifting more weight overhead allows for more muscle and strength.", "how_to_do": "Stand in front of a loaded barbell, set to about chin-height in a power rack. Grab the bar with a grip that’s slightly wider than shoulder-width. Brace your abs, dip your knees a little bit, and then explosively push the bar overhead. Catch the bar gently on your chest and then repeat.", "sets": 4, "image": "https://cdn.shopify.com/s/files/1/0269/5551/3900/files/Standing-Barbell-Shoulder-Press_600x600.png?v=1619977694", "video": "ep30avTSMB0", "expert_opinions": "If you’re tight on time and need to cut your workout short, the overhead press should be at the top of your list. Since this movement targets so many muscles, it’s a great option for lifters that want the most bang for their buck at the gym. As opposed to isolation pressing exercises which can be limited in nature, the overhead press has a much higher ceiling for total growth and progression.", "groups": [11, 4]}}, {"model": "exercises.exercise", "pk": 4, "fields": {"name": "Incline Bench Press", "description": "Even though the flat bench version is a powerlifter’s upper body bread and butter, the incline bench press is an undoubtedly useful training tool. Strongwoman and strongman athletes often appreciate the incline as a way to sneak in even more shoulder work to help with log presses and other overhead events. Bodybuilders work incline bench presses into their programs to build a complete chest. So no matter what kind of lifter you are, you can likely benefit from this bench press variation in your program.", "how_to_do": "Set up your bench at an angle of around 30-45°. Lie back and place your hands on the bar, slightly wider than shoulder-width apart, with your palms facing up. Lift the bar out of the rack and press it up until your arms are extended and your hands are above your shoulders. Slowly lower the bar to your chest, then press it back up again.", "sets": 4, "image": "https://thumbs.dreamstime.com/b/basic-rgb-237425145.jpg", "video": "11gY7Q5D5wo", "expert_opinions": "Want the best of both worlds? Include both the incline bench and the flat bench press in your chest workouts. The incline press will focus on the upper chest muscles to help balance out your chest development and the flat bench press will add overall mass and strength to your upper body and to the chest muscles.", "groups": [2, 11, 4]}}]